riccardo1980/esp8266-projects/WebServer/ServerHandlers.cpp
#include <ESP8266WebServer.h>
#include "ServerHandlers.h"
#include "FS.h"

extern ESP8266WebServer server;

String getPage(const char * filename){
  String out = "";
  SPIFFS.begin();
  File fid = SPIFFS.open(filename, "r");
  if (fid){
    out += fid.readString();
    fid.close();
  }
  else{
    out += "Can't read ";
    out += filename; 
  }
  return out;
}

void handleRoot() {
  String out = getPage("/root_form.html"); 
  server.send(200, "text/html", out);
  
  SPIFFS.end();
}

void handleLED() {                          // If a POST request is made to URI /LED
  digitalWrite(LED,!digitalRead(LED));      // Change the state of the LED
  server.sendHeader("Location","/");        // Add a header to respond with a new location for the browser to go to the home page again
  server.send(303);                         // Send it back to the browser with an HTTP status 303 (See Other) to redirect
}

void handleNotFound(){
  server.send(404, "text/plain", "404: Not found");
}

void drawGraph() {
  String out = "";
  char temp[100];
  out += "<svg xmlns=\"http://www.w3.org/2000/svg\" version=\"1.1\" width=\"400\" height=\"150\">\n";
  out += "<rect width=\"400\" height=\"150\" fill=\"rgb(250, 230, 210)\" stroke-width=\"1\" stroke=\"rgb(0, 0, 0)\" />\n";
  out += "<g stroke=\"black\">\n";
  int y = rand() % 130;
  for (int x = 10; x < 390; x += 10) {
    int y2 = rand() % 130;
    sprintf(temp, "<line x1=\"%d\" y1=\"%d\" x2=\"%d\" y2=\"%d\" stroke-width=\"1\" />\n", x, 140 - y, x + 10, 140 - y2);
    out += temp;
    y = y2;
  }
  out += "</g>\n</svg>\n";

  server.send(200, "image/svg+xml", out);
}
